src/Catalogs/Modules.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Modules</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.CommonModules</xr:Item>
				<xr:Item>Catalog.Constants</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.Projects</xr:Item>
				<xr:Item>Catalog.Commands</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Configuration</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ModuleKinds</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Path</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Data</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Modules/Ext/ManagerModule.bsl
Function Load(Parameters) Export
	Var Ref;
	
	Configuration = Parameters.Configuration;
	Owner = Parameters.Owner;
	Path = Parameters.Path;
	Kind = Parameters.ModuleKind;
	Ref  = Parameters.ModuleRef;
	
	// precondition:
	// # (Configuration == Owner.Owner)
	// # Path is file path
	
	This = Catalogs.Modules;
	
	If Not ValueIsFilled(Ref) Then
		Object = This.CreateItem();
		Ref = This.GetRef();
		Object.SetNewObjectRef(Ref);
	Else
		Object = Ref.GetObject();
	EndIf;
	
	// Properties
	
	Object.Owner = Owner;
	Object.Configuration = Configuration;
	Object.Kind = Kind;
	Object.Path = Path;
	
	If Abc.FileExists(Path) Then
		
		DataReader = New DataReader(Path, TextEncoding.UTF8);
		BinaryData = DataReader.Read().GetBinaryData();
		
		SHA1 = SHA1(BinaryData);
		If Object.SHA1 <> SHA1 Then
			Object.SHA1 = SHA1;
			Object.Data = New ValueStorage(BinaryData, New Deflation);
		EndIf; 
		
	EndIf; 
	
	Object.Write();	
	
	Return Object.Ref;
	
EndFunction // Load()

Function SHA1(BinaryData) Export
	Var SHA1;
	
	// git method
	
	DataHashing = New DataHashing(HashFunction.SHA1);
	DataHashing.Append("blob " + Format(BinaryData.Size(), "NZ=0; NG=") + Char(0));
	DataHashing.Append(BinaryData);
	
	SHA1 = GetHexStringFromBinaryData(DataHashing.HashSum);
	
	Return SHA1;
	
EndFunction // SHA1()
